compressible/dpEqn_Semi-Implicit_Inplace_GCIBM-regressingPlane/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     PC3D;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         20e-3;

deltaT          4e-9;

writeControl    timeStep;

writeInterval   250;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   9;

runTimeModifiable true;


// ************************************************************************* //
